Repository: nbruns1/tritondse
Catalog: doc/locale/*/LC_MESSAGES/dev_doc/coverage.po
Languages: fr

source: Coverage
fr: Couverture

source: Branch strategy enumerate. It defines the manner with which branches are checked with SMT on a single trace, namely a :py:obj:`CoverageSingleRun`. For a given branch that has not been covered strategies are:
fr: Enum de stratégie de branche. Il définit la manière dont les branches vont être résolues par SMT sur une seule trace d'exécution, c'est à dire dans un :py:obj:`CoverageSingleRun`.Pour une branche donnée qui n'a pas été couverte les stratégies sont:

source: ``ALL_NOT_COVERED``: check by SMT all occurences
fr: ``ALL_NOT_COVERED``: vérifie par SMT toutes les occurrences

source: ``FIRST_LAST_NOT_COVERED``: check only the first and last occurence in the trace
fr: ``FIRST_LAST_NOT_COVERED``: vérifie la première et la dernière occurrence dans la trace

source: Variant type representing a coverage item. It can be:
fr: Type variant représentant un artefact à couvrir. C'est soit:

source: an address :py:obj:`tritondse.types.Addr` for block coverage
fr: une adresse :py:obj:`tritondse.types.Addr` pour de la couverture de bloc

source: an edge :py:obj:`tritondse.types.Edge` for edge coverage
fr: une arête :py:obj:`tritondse.types.Edge` pour de la couverture d'arêtes

source: a string :py:obj:`tritondse.types.PathHash` for path coverage
fr: une chaîne de caractères :py:obj:`tritondse.types.PathHash` pour de la couverture de chemins

source: Coverage produced by a **Single Execution** Depending on the strategy given to the constructor it stores different data.
fr: Couverture produite sur **une seule exécution**. En fonction de la stratégie fournie au constructeur, elle emmagasine différents artefacts de couverture (CovItem).

source: Parameters
fr: Paramètres

source: Strategy to employ
fr: Stratégie à utiliser

source: Add an instruction address covered. *(Called by :py:obj:`SymbolicExecutor` for each instruction executed)*
fr: Ajoute l'adresse d'une instruction couverte. *(Appelée par :py:obj:`SymbolicExecutor` pour chaque instruction exécutées)*

source: The address of the instruction
fr: Adresse de l'instruction

source: Add a branch to our covered branches list. Each branch is encoded according to the coverage strategy. For code coverage, the branch encoding is the address of the instruction. For edge coverage, the branch encoding is the tupe (src address, dst address). For path coverage, the branch encoding is the MD5 of the conjunction of all taken branch addresses.
fr: Ajoute une branche couvertes. C'est cette fonction qui met à jour la couverture. Selon la stratégie, la branche est utilisée différemment. Pour de la couverture de blocs, seul l'adresse de l'instruction est conservée. Pour de la couverture d'arête, le tuple adresse source et adresse destination sont conservés. Enfin, pour de la couverture de chemin, l'arête est ajoutée aux précédentes déjà rencontrée puis hashé en MD5 pour encoder le chemin.

source: The address taken in by the branch
fr: Adresse prise dans le branchement

source: Information of the branch condition and its constraints
fr: Information de la condition de branchements et ses contraintes

source: List of addresses forming the path currently being taken
fr: Liste des adresses encodant le chemin emprunté

source: Edge coverage counter in case of edge coverage
fr: Compteur d'arêtes dans le cas du couverture d'arêtes

source: Instruction coverage. Counter for code coverage)
fr: Couverture d'instructions. (Compteur si couverture de code).

source: Return whether the item has been covered or not. **The item should match the strategy**
fr: Renvoie vrai si l'item (artefact) a été couvert ou non. **L'item doit être compatible avec la stratégie courante.

source: An address, an edge or a path
fr: Une adresse, une arête ou un chemin

source: Returns
fr: Renvoie

source: Edges not covered by the trace. Thus coverage objectives.
fr: Arêtes non couvertes dans une trace. Par conséquent les objectifs de couverture

source: Instruction not covered in the trace (targets of branching conditions never taken). It represent what can be covered by the trace (input), with the branches were negated. We call it coverage objectives.
fr: Instructions non couvertes dans la trace *(cible d'une condition de branchement jamais prise). Elles représente ce qui pourrait être couvert par l'entrée si les branches peuvent être niées. Ce sont des objectifs de couverture.

source: Paths not taken by the trace. Thus coverage objectives.
fr: Chemins non pris par la trace.

source: Path covered by the trace. It uses the path predicate. Thus solely symbolic branches are used to compute paths.
fr: Chemins couverts par la trace. Utilise le prédicat de chemin, donc seules les branches symboliques sont utilisées pour calculer le chemin.

source: Function is called after each execution for post processing or clean-up. *(Not doing anythin at the moment)*
fr: Fonction appelée après chaque exécution pour effectuer un post-traitement ou du nettoyage. *(ne fait rien pour le moment)*

source: Pretty print a CovItem according the coverage strategy
fr: Affiche un :py:obj:`CovItem`.

source: Coverage strategy
fr: Stratégie de couverture

source: The number of total instruction executed
fr: Nombre total d'instructions exécutées

source: The number of unique edges covered
fr: Nombre d'arêtes uniques couvertes

source: The number of unique instructions covered
fr: Nombre d'instructions uniques couvertes

source: Coverage strategy enum.
fr: Enum de stratégie de couverture

source: Global Coverage. Represent the overall coverage of the exploration. It is filled by iteratively call merge with the :py:obj:`CoverageSingleRun` objects created during exploration.
fr: Couverture Globale. Représente la couverture accumulée à travers toutes les exécutions. Elle est remplie itérativement à partir de :py:obj:`CoverageSingleRun` combiné à la fonction merge.

source: Coverage strategy to use
fr: Stratégie de couverture utilisée

source: Execution workspace (for saving loading the coverage)
fr: Espace de travail de l'exécution (pour sauvegarder/charger la couverture)

source: Branch checking strategies
fr: Stratégie de branchement

source: Check if some of the non-covered are not already in the global coverage Used to know if an input is relevant to keep or not
fr: Vérifie si la couverture d'un :py:obj:`CoverageSingleRun` peut améliorer la couverture globale déjà obtenue. Utilisée pour savoir s'il est pertinent de conserver une entrée ou non.

source: The CoverageSingleRun to check against our global coverage state
fr: L'objet CoverageSingleRun sur lequel vérifier la couverture

source: The function iterate the given path predicate and yield PatchConstraint to consider as-is and PathBranch representing the new branch to take. It acts as a black-box so that the SeedManager does not have to know what strategy is being used under the hood. From an implementation perspective the goal of the function is to manipulate the path WITHOUT doing any SMT related things.
fr: À partir d'un prédicat de chemin, renvoie sous forme de yield toutes les branches qui représentent de la nouvelle couverture à prendre. Cette fonction, agit en boîte noire pour que le SeedManager n'ait pas à avoir connaissance de la stratégie de couverture employée. D'un point de vue implémentation, le but de la fonction est de manipuler le prédicat de chemin sans effectuer de requêtes SMT.

source: Need to implement strategies for a given target returning, all occurences, only the first, only the last etc. At the moment only the first.
fr: Nécessite d'implémenter différentes stratégies pour renvoyer toutes les occurrences ou seulement la première/dernière. Pour le moment seul la première est renvoyée.

source: list of path constraint to iterate
fr: liste des contraints de chemin à itérer

source: generator of path constraint and branches to solve. The first tuple item is a list of PathConstraint to add in the path predicate and the second is the branch to solve (but not to keep in path predicate)
fr: Générateur de contraintes de chemins et de branches à résoudre. Un yield renvoie une liste de contraintes à ajouter à la conjonction et une branche spécifique à nier.

source: Load the coverage from the workspace
fr: Charge la couverture depuis l'espace de travail

source: Merge a CoverageSingeRun instance into this instance
fr: Merge un :py:obj:`CoverageSingleRun` dans cet objet

source: The CoverageSingleRun to merge into self
fr: Le CoverageSingleRun à merger dans self

source: Return all coverage items (addreses, edges, paths) that the given CoverageSingleRun can cover if it is possible to negate their branches
fr: Renvoie tous les artefacts de couverture qu'un objet :py:obj:`CoverageSingleRun` peux potentiellement couvrir si toutes ses branches peuvent être niées.

source: The CoverageSingleRun to check with our global coverage state
fr: Le CoverageSingleRun à vérifier sur l'état global (self)

source: A set of CovItem
fr: Un Set de CovItem

source: Set of pending coverage items. These are items for which a branch as already been solved and
fr: Ensemble d'artefacts de couverture. Cet ensemble représente tous les CovItem pour lesquels une branche à été résolue avec succès mais dont la couverture n'est pas encore effective car l'entrée associée n'a pas été exécutée.

source: Function called at the very end of the exploration. It saves the coverage in the workspace.
fr: Fonction appelée à la fin de l'exploration. Elle sauvegarde la couverture dans l'espace de travail.

source: Save the coverage in the workspace
fr: Sauvegarde la couverture dans l'espace de travail.
