Repository: nbruns1/tritondse
Catalog: doc/locale/*/LC_MESSAGES/api/callbacks.po
Languages: fr

source: Callback Mechanism
fr: Mécanisme de Callback

source: The whole interaction from tritondse with the user-written code is performed through the callback mechanism. Most callbacks does not expect return values but provides as argument all necessary variables which enable changing the state of the execution. Events that can be caught are:
fr: Toute l'interaction du code utilisateur avec tritondse se fait via un mécanisme de callback. La plupart des callbacks ne renvoient aucune valeur de retour mais fournissent en argument toutes les variables nécessaires qui permet de modifier l'état global de l'exécution. Les évenements qu'il est possible d'intercepter sont:

source: address reached
fr: adresse atteinte

source: instruction executed *(all of them)*
fr: instruction exécutée *(toutes)*

source: memory address read or written
fr: adresse mémoire lues ou écrite

source: register read or written
fr: registre lu ou écrit

source: function reached *(from its name)*
fr: fonction atteinte *(à partir de son nom)*

source: end of an execution
fr: la fin d'une exécution

source: thread context switch
fr: changement de contexte de thread

source: new input creation *(before it gets appended in the pool of seeds)*
fr: création d'une nouvelle entrée *(juste avant qu'elle soit ajoutée au pool d'entrées en attente)*

source: Only the new input creation, accept a modified input as return value. That enable post-processing an input just before it enter the pool of seeds. That is especially useful to recompute some fields etc.
fr: Seul l'évenement de création d'entrées accepte une valeur de retour qui est l'entrée de substitution à utiliser. Cela permet d'appliquer un post-traitement à l'entrée avant qu'elle soit ajoutée. Ce mécanisme permet d'ajuster certains champs ou certaines valeurs de l'entrées *(crc, etc)*

source: All callbacks are meant to be registered on the :py:obj:`CallbackManager`. That object managed by :py:obj:`SymbolicExplorator` will be transmitted to every :py:obj:`SymbolicExecutor` which will then be able to to catch all events. In such context, callbacks will be triggered indifferently from any execution. A user willing to do per-execution operation shall register an end of execution to catch to switch from on execution to the other.
fr: Tous les callbacks doivent être enregistrés sur un :py:obj:`CallbackManager`.Cet objet utilisé par :py:obj:`SymbolicExplorator` va ensuite être transmis à toutes les instances de :py:obj:`SymbolicExecutor` qui sera lui en mesure d'attraper tous les évenements. Dans ce contexte, les callbacks vont être déclenchées indifférement d'une exécution à l'autre. Un utiliseur voulant discriminer une exécution d'une autre dans une callback devra récupérer l'identifiant de l'exécution.

source: Class used to aggregate all callbacks that can be plugged inside a SymbolicExecutor running session. The internal structure ensure that check the presence of callback can be made in Log(N). All callbacks are designed to be read-only
fr: Classe utiliser pour aggréger tous les callbacks qui peuvent être branchés dans une exécution.La structure interne assure que la vérification de la présence d'une callback est faite en Log(N).

source: Parameters
fr: Paramètres

source: Program used to explore *(used to extract function)*
fr: Programme utilisé pour l'exploration *(utilisé pour extraire des informations)*

source: Bind callbacks on the given process state. That step is required to register callbacks on the Triton Context object. This is also used to keep a reference on the SymbolicExecutor object;
fr: Attache les callbacks sur le :class:`ProcessState`. Cette étape est requise pour enregistrer les callbacks sur un objet `TritonContext`. Cela est aussi utilisé pour garder une référence sur l'objet `SymbolicExecutor`.

source: SymbolicExecutor on which to bind callbacks
fr: :class:`SymbolicExecutor` sur lequel attacher les callbacks

source: Fork the current CallbackManager in a new object instance (that will be unbinded). That method is used by the SymbolicExplorator to ensure each SymbolicExecutor running concurrently will have their own instance off the CallbackManager.
fr: Fork le CallbackManager courant pour en créer une nouvelle instance *(qui elle ne sera pas attachée)*. Cette méthode est utilisée par :class:`SymbolicExplorator` pour s'assurer que chaque exécuteur *(s'ils sont lancé en parrallèles)* possèdent bien leur propre instance de CallbackManager.

source: Returns
fr: Renvoi

source: Fresh instance of CallbackManager
fr: Nouvelle instance de CallbackManager

source: Return type
fr: Type de retour

source: Get all the pre/post callbacks for a given address.
fr: Récupère toutes les pre/post callbacks d'une adresse donnée.

source: Address where to trigger the callback
fr: Adresse où attacher la callback

source: tuple of lists containing callback functions for pre/post respectively
fr: tuple de listes contenant les callbacks pre/post respectivement

source: Get the list of all function callback to call when thread is being scheduled.
fr: Récupère la liste des fonctions de callback à appeler lorsqu'un thread va s'exécuter

source: List of callbacks defined when thread is being scheduled
fr: Liste des callbacks définies quand un thread va s'exécuter

source: Get all the pre/post callbacks for the current symbolic execution.
fr: Récupère les callbacks pre/post pour l'exécution symbolique courante.

source: Get the list of all callbacks for an imported routine
fr: Récupère la liste des callbacks pour une routine importée

source: the routine name
fr: nom de la routine

source: Tuple of list of callbacks (for pre and post)
fr: Tuple de listes de callbacks (pre/post)

source: Get all the pre/post callbacks for instructions.
fr: Récupère les callbacks pre/post posées sur les instructions

source: Get the list of all function callback to call when an a new input is generated by SMT.
fr: Récupère la liste des callbacks appelées lorsqu'une nouvelle entrée est générée

source: List of callbacks to call on input generation
fr: liste des callbacks appelées à la génération d'une entrée

source: Check if the callback manager has already been binded on a given process state.
fr: Vérifie si le CallbackManager a déjà été attaché à un process ou non

source: True if callbacks are binded on a process state
fr: Vrai si le CallbackManager est attaché

source: Check whether a callback has alreday been registered or not
fr: Vérifie si l'objet contient des callbacks ou non

source: True if no callback were registered
fr: Vrai si aucune callback n'est enregistrée

source: Register a callback function on a given address before or after the execution of the associated instruction.
fr: Enregistre une callback sur l'adresse d'une instruction avant ou après qu'elle soit exécutée.

source: When to trigger the callback (before or after) execution of the instruction
fr: Quand attacher la callback (avant ou après) l'exécution de l'instruction

source: callback function
fr: fonction de callback

source: Register a callback on the address of the given function name. The address of the function is resolved through lief. Thus finding the function is conditioned by LIEF.
fr: Enregistre une callback sur une fonction donnée. L'adresse de la fonction est résolu avec :mod:`lief`. Par conséquent trouver la fonction est conditionné par LIEF.

source: Function name
fr: Nom de la fonction

source: True if registration succeeded, False otherwise
fr: Vrai si l'enregistrement a réussi, Faux sinon

source: Register a callback triggered on each instruction executed, before or after its side effects have been applied to ProcessState.
fr: Enregistre une callback appelée sur chaque instruction, avant ou après que ses effets de bord soient appliqués au :class:`ProcessState`.

source: before, after execution of the instruction
fr: avant, après exécution de l'instruction

source: callback function to trigger
fr: callback a appeler

source: Register a callback that will be triggered by any read in the concrete memory of the process state.
fr: Enregistre une callback appelé sur chaque lecture en mémoire dans l'état concrêt du programme.

source: Callback function to be called
fr: Callback à appeler.

source: Register a callback called on each write in the concrete memory state of the process.
fr: Enregistre une callback appelée sur chaque écriture dans l'état mémoire concrêt du programme.

source: Register a callback function called when the SMT solver find a new model namely a new input. This callback is called before any treatment on the input (worklist, etc.). It thus allow to post-process the input before it getting put in the queue.
fr: Enregistre une callback déclenchée quand une nouvelle entrée est générée. Cette fonction est appelée avant l'ajout de celle-ci dans le pool d'entrées. Cela permet de post-traiter l'entrée avant qu'elle soit ajoutée à la queue.

source: Register post-address callback. Equivalent to register a pre-address on the return site. *(assume the function returns)*
fr: Enregistre une callback post-adresse.

source: Register a callback executed after program loading, registers and memory initialization. Thus this callback is called after executing upon program exit (or crash)
fr: Enregistre une callback exécutée après l'exécution de la cible, c'est à dire après le exit ou un crash.

source: Callback function to trigger
fr: Fonction de callback à appeler

source: Register a callback, called after the call to imported routines.
fr: Enregistre une callback, appelée après l'appel à une fonction importée.

source: Register a post-execution callback on all instruction executed by the engine.
fr: Enregistre une callback appelée après l'exécution de chaque instruction.

source: Register pre address callback
fr: Enregistre une callback en pré-adresse.

source: Register a callback executed after program loading, registers and memory initialization. Thus this callback is called just before executing the first instruction.
fr: Enregistre une callback exécutée après chargement du programme et de l'initialisation de la mémoire. Cette callback est appelée juste avant d'exécuter la première instruction.

source: Register a callback before call to an imported routines
fr: Enregistre une callback appelée sur une fonction importée.

source: Register a pre-execution callback on all instruction executed by the engine.
fr: Enregistre une callback de pre-exécution sur chaque instructions exécutées;

source: Register a probe. That function will iterate the ``cbs`` attribute of the object, and will register each entries in self.
fr: Enregistre une probe. Cette fonction va itérer l'attribut ``cbs`` de l'object et va enregistrer chaque entrées dans 'self'.

source: Does not implement all CbType
fr: N'implémente pas tous les `CbType`

source: a probe interface
fr: une probe interface

source: Register a callback on each register read during the symbolic execution.
fr: Enregistre une callback sur chaque registre lu pendant l'exécution symbolique.

source: Register a callback on each register write during the symbolic execution.
fr: Enregistre une callback sur chaque registre écrits pendant l'exécution.

source: Register a callback triggered upon each thread context switch during the execution.
fr: Enregistre une callback appelée sur chaque changement de thread pendant l'exécution;

source: Callback to be called
fr: Callback à appeler

source: **Auxiliary enumerate:**
fr: **Enums auxiliaires:**

source: Enmus representing callback position
fr: Enum qui represente le point d'injection d'une callback

source: The :py:obj:`ProbeInteface` is a very simple mechanism to register multiple callbacks all at once by subclassing the interface. This interface expect a local attriubte ``cbs`` containing callback related informations.
fr: l'interface :py:obj:`ProbeInteface` est un mécanisme simple pour enregistrer plusieurs callbacks d'un coup en héritant d'une interface. Cette interface attend uniquement un attribut ``cbs`` contenant les informations relatives aux callbacks.

source: list of callback infos
fr: liste des infos des callbacks

source: The probe interface might evolve in the upcoming versions
fr: L'interface de probe est vouée à évoluer dans les versions futures.

source: **Auxiliary enums**:
fr: **Enums auxiliaires:**

source: Enmus representing all kind of callbacks
fr: Enum qui représente tous les types de callbacks

source: Callback signatures
fr: Signature des Callbacks
