Repository: nbruns1/tritondse
Catalog: doc/locale/*/LC_MESSAGES/api/executor.po
Languages: fr

source: Single Program Execution Class. That module, is in charge of performing the process loading from the given program.
fr: Classe qui représente une seule exécution. Ce module effectue le chargement du programme puis de l'exécuter.

source: Parameters
fr: Paramètres

source: configuration file to use
fr: fichier de configuration à utiliser

source: input file to inject either in stdin or argv (optional)
fr: fichier d'entrée à injecter dans stdin ou argv (optionnel)

source: Workspace to use. If None it will be instanciated
fr: Workspace à utiliser. Si None, une nouvelle instance est créée

source: Unique ID. Given by :py:obj:`SymbolicExplorator` to identify uniquely executions
fr: Identifiant unique de l'exécution donnée par :py:obj:`SymbolicExplorator`

source: callbacks to bind on this execution before running *(instanciated if empty !)*
fr: CallbackManager à attacher avant l'exécution *(instancié si vide)*

source: Abort the current execution. It works by raising an exception which is caught by the emulation function that takes care of returning appropriately afterward.
fr: Interrompt l'exécution courante. Fonctionne en levant une exception qui est attrapée par la fonction d'émulation qui va alors renvoyer le code de retour approprié.

source: Raises
fr: Exceptions

source: to abort execution from anywhere
fr: pour interrompre l'exécution depuis n'importe où

source: Get the callback manager associated with the execution.
fr: Récupère le CallbackManager associé à l'exécution

source: Return type
fr: Type de retour

source: Coverage of the execution
fr: Couverture de l'exécution

source: Add a seed to the queue of seed to be executed in later iterations. This function is meant to be used by user callbacks.
fr: Ajoute une graine dans la queue des graines en attente d'exécution. Cette fonction est l'interface privilégiée pour l'utilisateur.

source: Seed to be added
fr: Graine à ajouter

source: Time taken for the execution in seconds
fr: Temps d'exécution en secondes

source: Only relevant at the end of the execution
fr: Uniquement pertinent à la fin de l'exécution

source: Returns
fr: Renvoie

source: execution time (in s)
fr: temps d'exécution (en secondes)

source: Exit code value of the process. The value is simply the concrete value of the register marked as return_register (rax, on x86, r0 on ARM..)
fr: Valeur de retour de l'exécution du programme.

source: Inject the given seed at the given address in memory. Then all memory bytes are symbolized.
fr: Injecte la graine à l'adresse donnée en mémoire. Puis tous les octets de la mémoire sont symbolisés.

source: address at which to inject input
fr: adresse à laquelle injecter une entrée

source: Seed to inject in memory
fr: Graine à injecter en mémoire

source: prefix name to give the symbolic variables
fr: prefix à donner aux variables

source: Get whether or not the seed has been injected.
fr: Renvoi si oui ou non la graine a déjà été injectée ou non

source: True if the seed has already been inserted
fr: Vrai si la graine a été injectée

source: Load the given process state. Do nothing but setting the internal ProcessState.
fr: Charge le process state. Ne fais rien d'autre qu'initialiser l'attribut.

source: PrcoessState to set
fr: ProcessState

source: Load the given program in the symbolic executor's ProcessState. It override the current ProcessState if any.
fr: Charge le programme donné dans le ProcessState du SymbolicExecutor. Il écrase le ProcessState courant s'il en est un.

source: debug function to track memory consumption of an execution
fr: fonction de debug pour suivre la consommation mémoire d'une exécution

source: Given a SMT Model creates a new Seed.
fr: Étant donné un modèle SMT crée une nouvelle graine.

source: SMT model
fr: Modèle SMT

source: new seed object
fr: nouvelle objet Seed

source: List of pending seeds gathered during execution.
fr: Listes des nouvelles graines qui ont été générées pendant l'exécution.

source: Only relevant at the end of execution
fr: Uniquement pertinent à la fin de l'exécution

source: list of new seeds generated
fr: liste des nouvelles graines générées

source: Execute the program.
fr: Exécute le programme.

source: If the :py:attr:`tritondse.Config.execution_timeout` is not set the execution might hang forever if the program does.
fr: Si :py:attr:`tritondse.Config.execution_timeout` n'est pas configuré, l'exécution peux boucler à l'infini si le programme ne s'arrête pas.

source: Address where to stop (if necessary)
fr: Adresse où s'arrêter (si nécessaire)

source: Skip the current instruction before it gets executed. It is only relevant to call it from pre-inst or pre-addr callbacks.
fr: Saute l'instruction courante avant qu'elle soit exécutée. Cette fonction n'est pertinente que s'il elle est appelée dans une callback PRE.

source: to skip the current instruction
fr: pour sauter l'instruction courante

source: Function to call to stop the whole exploration of the program. It raises an exception which is caught by SymbolicExplorator.
fr: Fonction à appeler pour stopper l'exploration du programme. Elle lève une exception qui est capturée par le SymbolicExplorator.

source: to stop the exploration
fr: pour stopper l'exploration
