Repository: nbruns1/tritondse
Catalog: doc/locale/*/LC_MESSAGES/api/program.po
Languages: fr

source: Representation of a program (loaded in memory). This class is wrapping `LIEF <https://lief.quarkslab.com/doc/latest>`_ to represent a program and to provide all the features allowing to pseudo-load one regardless of its format.
fr: Représente un programme *(chargé en mémoire)*. Cette classe encapsule `LIEF <https://lief.quarkslab.com/doc/latest>`_ pour représenter un programme et fournit tous les fonctionnalités permettant de "charger" un programme quel qu'en soit le format.

source: Parameters
fr: Paramètres

source: Program path
fr: chemin du programme

source: Raises
fr: Exception

source: if the file is not properly recognized by lief or in the wrong architecture
fr: si le fichier n'est pas proprement reconnu

source: Architecture enum representing program architecture.
fr: Enum qui représente l'architecture du programme

source: Return type
fr: Type de retour

source: Endianness of the program as defined in binary headers.
fr: Endianness du programme défini dans les en-têtes du binaire

source: Program entrypoint address as defined in the binary headers
fr: Point d'entré du programme défini dans les en-têtes du binaire

source: Search for the function name in fonctions of the binary.
fr: Cherche une fonction à partir de son nom dans le binaire

source: Function name
fr: Nom de la fonction

source: Returns
fr: Renvoie

source: Function object if found
fr: Objet fonction si trouvé

source: Binary format. Supported formats by lief are: ELF, PE, MachO
fr: Format du binaire. Les formats supportés par lief sont: ELF, PE, MachO

source: Iterate over all imported functions by the program. This function is a generator of tuples associating the function and its relocation address in the binary.
fr: Itère les fonctions importées par le programme. Cette fonction est un générateur de tuples associant une fonction à son adresse de relocation dans le binaire.

source: Generator of tuples function name and relocation address
fr: Générateur de tuples avec nom de fonction et adresse de relocation

source: Iterate over all imported variable symbols. Yield for each of them the name and the relocation address in the binary.
fr: Itère sur les symboles importés. Renvoie pour chacun d'eux le nom du symbole et l'adresse de relocation dans le binaire.

source: Generator of tuples with symbol name, relocation address
fr: Générateur de tuple avec nom de symbole et adresse de relocation

source: Iterate over all memory segments of the program as loaded in memory.
fr: Itère sur tous les segments mémoire tel que chargés en mémoire

source: Generator of tuples addrs and content
fr: Générateur de tuples avec adresse et contenu

source: if the binary format cannot be loaded
fr: si le binaire ne peux pas être chargé

source: Binary file path
fr: Chemin du binaire

source: LIEF relocation enum associated with the current architecture of the binary.
fr: Enum LIEF des relocations de l'architecture cible

source: LIEF relocation enum
fr: Enum LIEF des relocations
