Repository: nbruns1/tritondse
Catalog: doc/locale/*/LC_MESSAGES/tutos/hooks.po
Languages: fr

source: Playing with Hooks
fr: Jouer avec les hooks

source: Setting hooks is the main interface with an execution and an exploration to perform user-defined actions. Tritondse enables hooking the following events:
fr: Positionner un hook est le mécanisme d'interface principal pour effectuer de actions durant une exécution ou une exploration. Tritondse permet de 'hooker' les événements suivants:

source: address reached
fr: adresse atteinte

source: instruction executed *(all of them)*
fr: instruction exécutée *(toutes)*

source: memory address read or written
fr: adresse mémoire lue ou écrite

source: register read or written
fr: registre lu ou écrit

source: function reached *(from its name)*
fr: fonction atteinte *(à partir de son nom)*

source: end of an execution
fr: fin d'une exécution

source: thread context switch
fr: context-switch d'un thread

source: new input creation *(before it gets appended in the pool of seeds)*
fr: nouvelles entrée générée *(avant qu'elle soit ajoutée dans le pool de graines)*

source: The library introduces a ``CallbackManager`` object which enables registering callbacks. A ``SymbolicExecutor`` do contains such object. In the case of a ``SymbolicExplorator`` it also contains a callback_manager instance, but this one will be transmitted to all subsequent ``SymbolicExecutor`` instances.
fr: La bibliothèque introduit un objet ``CallbackManager`` qui permet d'enregistrer des callbacks. Un objet ``SymbolicExecutor`` en contient un. Un ``SymbolicExplorator`` en contient un aussi mais celui-ci est partagé et transmis à toutes les instances sous-jacentes de ``SymbolicExecutor``.

source: For this notebook we are going to reuse a ``SymbolicExecutor`` and hooking various events of the run.
fr: Pour ce notebook, nous allons utiliser un ``SymbolicExecutor`` et hooker différents événements d'une exécution.

source: I. Instruction hooking
fr: I. Hooking d'instructions

source: Instruction hooking enables hooking the execution of every instruction executed regardless of theirs address etc.
fr: Le hooking d'instruction permet d'effectuer une action sur chaque instruction exécutée quelque que soit sont adresse.

source: The signature for an instruction hook is the following:
fr: La signature pour une fonction de hooking d'instruction est:

source: We can use it to print every instructions executed:
fr: On peux l'utiliser par exemple, pour afficher chaque instruction exécutées:

source: We can hook any address and perform any associated action.
fr: On peux hooker n'importe quelle adresse pour y effectuer une action particulière.

source: We can also hook any function as long as the symbol is set. They both have the same signature:
fr: On peux aussi hooker n'importe quelle fonction à partir de son nom *(s'il est disponbile)*. Tout deux on la même signature:

source: For the purpose of the challenge let’s hook the compare instruction and patch de ZF flag to force looping. Let’s also hook the ``puts`` function to print the string given to each call.
fr: Pour le challenge, nous allons hooker l'instruction de comparaison et patcher le drapeau ZF pour forcer l'exécution à refaire des tours de boucle. On peux aussi hooker la fonction ``puts`` pour afficher la chaîne de caractère envoyée en paramètre.

source: We did not really win where as we forced the ZF flag, but we have encoded values on wich the comparison is made.
fr: Nous n'avons pas réellement gagné aussi car le drapeau a été forcé mais cela a permis de récupérer la valeur encodée avec laquelle la comparaison était faite.

source: We can modify our hook to directly solve by SMT what shall be the appropriate value of CL in order to match the comparison.
fr: On peux modifier le hook pour effectuer une requête SMT afin de demander au solveur la valeur attendue pour CL afin que la comparaison soit valide.

source: IV. Hooking exploration events
fr: IV. Hooker les événements d'exploration

source: We can similarly put callbacks on a ``SymbolicExplorator``. In this case, the callback manager will be shared among all the ``SymbolicExecutor`` instances. Let’s hook every iteration to print some statistics:
fr: De la même manière on peux poser des callbacks sur les évenements d'exploration. Par exemple on peux à chaque itération afficher quelques statistiques:
