Repository: nbruns1/tritondse
Catalog: doc/locale/*/LC_MESSAGES/tutos/sanitizers.po
Languages: fr

source: Sanitizers & Probes
fr: Sanitiseurs & Probes

source: Probe mechanism
fr: Méchanisme de probe (sonde)

source: TritonDSE introduces a probe mechanism. A probe is simply a class exposing a set of callbacks to register to the execution. That enables writing more complex checkers that can be easily registered on a callback manager.
fr: TritonDSE introduit un mécanisme de probe (sonde). Il se matérialise par une classe exposant différentes callbacks qui s'attacheront à une exécution. Cela permet d'écrire des 'checker' plus complexes que l'on peux enregistrer facilement sur un manageur de callback.

source: A probe as the following interface:
fr: Une sonde a l'interface suivante:

source: So to write its own probe one, just have to call ``_add_callback`` with its own hooks *(usually some other methods)*. They will automatically be picked by the callback manager and registered.
fr: Pour écrire sa propre probe, il suffit d'appeler ``_add_callback`` avec ses propre hooks *(typiquement d'autres méthodes)*. Celles-ci seront automatiquement récupérée par le manager de callback et enregistrée sur celui-ci.

source: Using built-in sanitizers
fr: Utiliser les sanitiseurs fournis

source: TritonDSE provides few simple sanitizers developped as probes. These sanitizers are the following:
fr: TritonDSE fournit quelques sanitiseurs développés comme des probes. Ces sanitiseurs sont les suivants:

source: UAFSanitizer: checks for UaF using the simple built-in allocator *(in ProcessState)*
fr: UAFSanitizer: vérifie la précense de UaF en utilise l'allocateur de ``ProcessState``.

source: NullDerefSanitizer: checks that no read or write in memory is performed at address 0
fr: NullDerefSanitizer: vérifie qu'aucune lecture ou écriture en mémoire n'est effectuée à l'adresse 0

source: FormatStringSanitizer: hooks various libc functions and checks that format string are not controlled
fr: FormatStringSanitizer: hook différentes fonctions de la libc pour vérifier que les chaînes de format ne sont pas controllées par l'utilisateur

source: IntegerOverflowSanitizer: checks that the overflow flag is not set, and also that it is not symbolic *(might raise false positives)*
fr: IntegerOverflowSanitizer: vérifie que le drapeau OV (overflow) n'est pas positionné et qu'il n'est pas symbolique *(cette probe lève de nombreux faux positifs)*

source: The registration of a probe can be done as follows:
fr: L'enregistrement d'une sonde se fait comme suit:

source: The probe will now be enabled for all executions.
fr: La sonde est dès lors activée pour toutes les exécutions.

source: Writing a sanitizer
fr: Écrire un sanitiseur

source: For the purpose of this tutorial, let’s write a sanitizer that will checks ``fopen`` libc call and its variant ``freopen`` cannot be hijacked to open an unwanted file *(here /etc/passwd)*. We are first going to check that the string given in input is controllable and if it is, checking by SMT that it can be the intended string.
fr: Pour ce tutoriel, nous allons écrire un sanitiseur qui va vérifier que sur ``fopen`` et sa variante ``freopen`` le chemin donné n'est pas controllé par l'utilisateur et qu'il ne peux pas être détourné pour lire */etc/passwd*. Pour cela, il faut d'abord vérifier que la chaîne est controllable est si c'est le cas vérifier par SMT qu'on peux y insérer la chaîne voulue.

source: Then we just have to register our new sanitizer!
fr: Il ne reste alors plus qu'à enregistrer le sanitiseur.

source: There are no open in the crackme *(but one can try with another example)*
fr: Le crackme ne contient pas de open, mais il est possible de tester avec un exemple jouet.
