Repository: nbruns1/tritondse
Catalog: doc/locale/*/LC_MESSAGES/tutos/seeds.po
Languages: fr

source: Managing Seeds
fr: Gestion des entrées

source: This quick tutorial explains how to deal with input files manipulated and generated during the execution. Let’s reuse the following base snippet. The only difference here is that we are going to change the coverage strategy to ``PATH_COVERAGE``.
fr: Ce tutoriel explique comment manipuler est gérer les graines (seed) générées durant l'exécution. L'on va réutiliser le snippet de base à l'exception de la stratégie de couverture qui va être positionnée en ``PATH_COVERAGE``.

source: Just by exploring all possible paths we managed to solve the challenge. Let’s play with the corpus.
fr: En explorant tous les chemins possible il a été possible de résoudre le challenge. On peux alors manipuler le corpus.

source: Initial Corpus
fr: Corpus initial

source: There are two ways to provide an initial corpus:
fr: Il y a deux manières de fournir un corpus intial:

source: providing in existing workspace directory and putting manually files in the *worklist* directory
fr: fournir un workspace existant, et placer manuellement les fichiers dans le dossier *worklist*.

source: via the API by adding the seed with ``add_input_seed``, it will automatically be added in seeds to process.
fr: via l'API en ajoutant chaque graine avec ``add_input_seed`` qui va automatiquement ajouter la graine dans la file d'attente.

source: Managing generated corpus
fr: Gérer le corpus généré

source: **SymbolicExecutor**: This class is solely meant to execute a single seed, not to produce new ones *(that is the purpose of the explorator)*. However if a one wants to generate a new input to process in a callback, it is possible with the method ``enqueue_seed``. That method will just fill a list that will later be picked-up by the ``SymbolicExplorator`` instance.
fr: **SymbolicExecutor**: Cette classe a vocation d'exécution une seule graine et non pas en produire de nouvelle *(cette tâche est déléguée à l'explorateur)*. Cependant, il est possible dans un callback durant un exécution d'ajouter des entrées à exécuter dans les itérations suivantes. Pour cela ``enqueue_seed`` va conserver les entrées et celles-ci seront récupérées par le ``SymbolicExplorator`` à la fin de l'exécution.

source: Here is a dummy hook function that manually negate a branching condition to generate a new input file:
fr: Voici une fonction de test qui manuellement nie un branchement conditionnel pour générer une nouvelle entrée:

source: By default the status of the seed generated is ``FRESH`` but the seed you generated is a faulty one, you can directly assign it the ``CRASH`` status.
fr: Par défaut le status d'une graine générée est ``NEW`` et sera donc exécutée dans une itération ultérieure. Cependant, si c'est une entrée de crash il est possible de lui assigner directement le status ``CRASH``.

source: **SymbolicExplorator**: All seeds generated during the exploration are moved in the ``Workspace`` instance from the *worklist* folder to the appropriate one *corpus*, *hangs* and *crashs*. One can iterate them using the workspace instance.
fr: **SymbolicExplorator**: Toutes les graines générées durant l'exploration sont gérées physiquement sur le disque par l'objet ``Workspace`` qui va les déplacer dans le bon dossier selon le status (*corpus*, *hangs*, *crash*).

source: Setting seed status
fr: Positionner le status de la graine

source: During the execution one, can assign a status to the seed currently being executed in any callback. *(Make sure not to override a status previously set by another callback)*. At the end of an execution of no status has been assigned, the seed is automatically assigned ``OK_DONE``.
fr: Durant l'exécution, l'utilisateur peux assigner un status à une graine. Il faut juste vérifier ne pas écraser un status déja positionné. Si aucun status n'a été assigné et que l'exécution s'est bien terminée, la graine reçoit le status ``OK_DONE``.
