Repository: nbruns1/tritondse
Catalog: doc/locale/*/LC_MESSAGES/tutos/starting.po
Languages: fr

source: Getting Started
fr: Démarrer

source: This tutorial introduces the TritonDSE library providing a high-level easy to use interface for Triton.
fr: Ce tutoriel introduit la bibliothèque TritonDSE qui fournit une API haut-niveau à Triton.

source: Disclaimer: This library is experimental. Most code has been writing toward satisfying PASTIS objectives. Thus it lacks many features and the API is subject to changes.
fr: Attention: Cette bibliothèque est expérimentale. L'essentiel du code a été écrit pour satisfaire les exigences du projet PASTIS. Il manque donc problablement des fonctionnalités et l'API est sujette à changement.

source: Tritondse works in pure emulation so it theoretically have to model all program side-effects syscalls etc. This is not possible so it works in a very opportunistic manner. As of now limitations are the following:
fr: TritonDSE fonctionne en pure émulation, il doit donc modéliser tous les effets de bords appels systèmes etc. Comme il est impossible d'être exhaustif, ce support est ajouté de manière opportuniste. Pour le moment les limitations sont les suivantes:

source: Limited to Linux ELF binaries
fr: Limité aux binaires ELF Linux

source: Only support a subset of libc function calls *(no C++ runtime functions)*
fr: Seul un sous-ensemble des fonctions de la libc sont supportées *(aucune du runtime C++)*

source: No modeling of syscalls, *(they have to be modeled manually)*
fr: Aucune modélisation des appels systèmes *(ils doivent donc être modelisés manuellement)*

source: TritonDSE have the same weaknesses than Triton in model floating point, or some specific instruction sets.
fr: TritonDSE a les mêmes limitations que Triton pour la modélisation des flottants ou d'autres jeux d'instruction spécifiques.

source: For the purpose of this tutorial any samples can be used but we are going to use to following crackme that can be downloaded `here <../../../_static/crackme_xor>`__. We are first going to create a ``Program`` object which is solely a thin wrapper on `LIEF <https://lief.quarkslab.com>`__.
fr: Pour ce tutoriel nous allons utiliser le crackme qui peux être téléchargé `ici <../../../_static/crackme_xor>`__. On va d'abord créer un objet ``Program`` qui est un wrapper sur `LIEF <https://lief.quarkslab.com>`__.

source: By the default the ``Program`` only expose few fields required to peform the loading of the program. Thus segments or imported functions are exposed. The main utility is being able to retrieve a function object *(as LIEF object)*
fr: Par défaut un ``Program`` expose uniquement les champs requis pour effectuer le chargement du programme. Ainsi, les segments et les relocations sont exposées. La principale utilitée de cet objet est de pouvoir récupérer les fonctions *(comme object LIEF)*.

source: To perform any specific processing using directly the LIEF Binary object it can be retrieved *(even though it is not directly exposed)*
fr: Pour effectuer des traitements spécifiques sur l'objet LIEF il peux être récupéré *(même s'il n'est pas directement exposé)*.

source: Now we need to load the program in the process state and then start the program at its entrypoint by providing it a concrete input that will either be injected in *stdin* or on argv depending on the need. Hopefully everything is done transparently by ``SymbolicExecutor``.
fr: Il faut maintenant charger le program dans un objet ``ProcessState`` est ensuite démarrer l'exécution symbolique sur le point d'entré du program avec une graine donnée. Cela est fait de manière transparente par l'objet ``SymbolicExecutor``.

source: This object is in charge of performing a single execution with the given configuration on the process state using the given program.
fr: Cet objet est en charge d'effectuer une exécution avec la configuration et le programme donné.

source: The ``run`` methods will take care of loading the program, performing the dynamic relocations (PLT stuff etc) and then to start emulating from the entrypoint.
fr: La méthode ``load_program`` charge le programme et initialise l'état mémoire interne. Il effectue aussi toutes les relocations et positionne le pointeur d'instruction sur le point d'entré.

source: We now have successfully performed a single run of our program. After execution, the ``ProcessState`` has been updated and represent the program after execution and a ``CoverageSingleRun`` as been produced which represent to coverage generated by the execution.
fr: Le programme a été exécuté et l'objet ``ProcessState`` a été mis à jour au fil de l'exécution. Un objet ``CoverageSingleRun`` représentant le couverture de l'exécution a aussi été produit.

source: III. Manipulating concrete state
fr: III. Manipuler l'état concret

source: A process can be manipulated and modified at any time during the execution. Both the concrete state and symbolic state can be modified.
fr: Un process peut être manipulé et modifié à n'importe quel moment de l'exécution. Aussi bien l'état concret que l'état symbolique peuvent être modifiés.

source: Process infos:
fr: Information du processus:

source: a. Reading, writing registers (function API)
fr: a. Lire, écrire un registre (API fonctionnelle)

source: Most of the API enables addressing register either by an enum identifier *(triton one)* or directly with theirs string.
fr: La plupart des fonctions de l'API identifient un registre par l'enum Triton ou bien directement par leur nom.

source: A ``ProcessState`` also provides some alias to access program counter, stack register, base pointer or return register in a portable way.
fr: Un ``ProcessState`` fournit aussi des alias portables pour le pointeur d'instruction le pointeur de pile (et de base) ou encore le registre recevant les valeurs de retour.

source: Then both concrete an symbolic values can be modified using a function-style API.
fr: Aussi bien les valeurs concrètes que symboliques peuvent être modifiées avec l'API fonctionnelle.

source: b. Reading, writing registers (Pythonic API)
fr: b. Lire, écrire des registres (API 'pythonic')

source: To ease manipulation of the registers concrete values, the ``ProcessState`` introduces a ``cpu`` attributes that transparently updates the underlying triton context.
fr: Pour faciliter la manipulation des valeurs concrètes de regsitre, l'objet `ProcessState`` contient un attribut ``cpu`` qui effectue les mises à jour du context triton de manière transparente.

source: When manipulating memory what differs is whether we write bytes or integers. In the case of integers, the endianess will be taken in account when reading, writing in memory.
fr: Lorsqu'on manipule la mémoire, on lis ou écrits soit des octets soit des entiers. Dans le cas des entiers le boutisme entre en compte pour renverser ou non les octets.

source: The exact same functions exists for writing: ``write_memory_int``, ``write_memory_ptr``, ``write_memory_bytes``.
fr: Les mêmes fonctions existent pour écrire: ``write_memory_int``, ``write_memory_ptr``, ``write_memory_bytes``.

source: A ``ProcessState`` object also enables checking whether an address is mapped in memory:
fr: Un objet ``ProcessState`` permet de vérifier qu'une adresse est mappée en mémoire:

source: IV. Manipulating symbolic state
fr: IV. Manipuler l'état symbolique

source: Both symbolic registers and symbolic memory can be manipulated in a similar fashion than the concrete state.
fr: L'état symbolique des registres et de la mémoire peuvent être manipulés comme l'état concrêt.

source: One should be cautious when manipulating the symbolic state to keep it consistent with the concrete state in order to remain sound.
fr: Il faut faire attention en manipulant l'état symbolic pour le garder cohérent avec l'état concrêt afin de rester correct.

source: Symbolic values can be read written with a similar API than concrete state.
fr: Des valeurs symboliques peuvent être écrites de la même manière que l'état concrêt

source: The same can be done on memory with ``read_symbolic_memory_byte``, ``read_symbolic_memory_bytes``, ``read_symbolic_memory_int`` and theirs equivalent for writing.
fr: La même chose peut être faite avec la mémoire ``read_symbolic_memory_byte``, ``read_symbolic_memory_bytes``, ``read_symbolic_memory_int`` et leurs équivalent pour écrire.

source: Disclaimer: Writing an arbitrary symbolic value in a register or memory might break soundness, and the dependency with previous definition of the variable. In standard usage a user, is usually not supposed to modify symbolic values but rather to concretize values or adding new constraints in the path predicate.
fr: Attention: Écrire une valeur symbolique arbitraire dans un registre ou de la mémoire peut casser la correction de l'exécution *(et écrase toute dépendances avec les précédantes définitions de la variable)*. Dans un usage standard, un utilisateur n'est pas censé modifier les valeurs symboliques. En revanche, il peux concrétiser des valeurs ou ajouter des contraintes sur des symboles (via ``push_path_constraints``).

source: We using the concrete value of a register *(or memory)* to produce side-effects on the system we usually have to concretize to value in order to remain sound wrt to execution. We can do it with ``concretize_register`` that will enforce the symbolic value to match the current concrete value.
fr: Lors qu'on modélise un effet de bord et que pour cela on utilise une valeur concrète, il faut généralement la concrétiser pour rester correct. Cela est faisable avec la fonction ``concretize_register`` qui va forcer une valeur symbolique à prendre la valeur concrète donnée (tout en restant symbolique).

source: We also can push our own constraints in the symbolic state.
fr: Il est évidemment possible d'ajouter des contraintes symbolique au cours de l'exécution.

source: As seen before, a ``SymbolicExecutor`` takes a a ``Config`` object as input. It tunes multiple parameters that will be used during execution and exploration. These parameters are the following:
fr: Comme vu précédemment, un objet ``SymbolicExecutor`` prend un objet ``Config`` en entrée. Il ajuste les paramètres à appliquer durant l'exécution et l'exploration. Ces paramètres sont les suivants:

source: symbolize_argv (bool): Symbolize parameters given on the command line
fr: symbolize_argv (bool): Symbolise les paramètres donnés sur la ligne de commande

source: symbolize_stdin (bool): Symbolize reads on ``stdin``
fr: symbolize_stdin (bool): Symbolise les lectures sur ``stdin`` (la première)

source: pipe_stdout (bool): Pipe the program stdout to Python’s stdout
fr: pipe_stdout (bool): Transmet la sortie standard sur la sortie standard du programme python

source: pipe_stderr (bool): Pipe the program stderr to Python’s stderr
fr: pipe_stderr (bool): Transmet la sortie d'erreur sur celle du programme python

source: skip_sleep_routine (bool): Whether to emulate sleeps routine or to skip it
fr: skip_sleep_routine (bool): Emuler ou non les routines de sleep (ou les sauter)

source: smt_timeout (int): Timeout for a single SMT query in milliseconds
fr: smt_timeout (int): Timeout à appliquer pour une seule query SMT (en milliseconds)

source: execution_timeout (int): Timeout of a single execution *(in secs)*
fr: execution_timeout (int): Timeout à appliquer sur une seule exécutino *(en secondes)*

source: exploration_timeout (int): Overall timeout of the exploration (in secs)\*
fr: exploration_timeout (int): Timeout de l'exploration *(en secs)*

source: exploration_limit (int): Number of execution iterations. *(0 means unlimited)*
fr: exploration_limit (int): Nombre d'itérations d'exécutions *(0 illimité)*

source: thread_scheduling (int): Number of instructions to execute before switching to the next thread
fr: thread_scheduling (int): Nombre d'instructions à exécuter dans chaque threads avant d'effectuer un context-switch

source: smt_queries_limit (int): Limit of SMT queries to perform for a single execution
fr: smt_queries_limit (int): Limite de requêtes SMT à effectuer par exécution

source: coverage_strategy (CoverageStrategy): Coverage strategy to apply for the whole exploration
fr: coverage_strategy (CoverageStrategy): Stratégie de couverture à appliquer pour toute l'exploration

source: branch_solving_strategy (BranchCheckStrategy): Branch solving strategy to apply for a single execution
fr: branch_solving_strategy (BranchCheckStrategy): Stratégie de résolution des branches à appliquer

source: debug (bool): Enable debug logging or not
fr: debug (bool): Active le debug de logging ou non

source: workspace (str): Workspace directory to use
fr: workspace (str): Dossier de workspace à utiliser

source: program_argv (List[str]): Concrete program argument as given on the command line
fr: program_argv (List[str]): Argument à donner en ARGV du programme *(si entrées sur stdin)*

source: time_inc_coefficient (float): Execution time of each instruction *(for rdtsc)*
fr: time_inc_coefficient (float): Coefficient de temps d'exécution pour chaque instruction *(pour rdtsc)*

source: Now that we performed a single run, lets try to explore the program by symbolizing ``argv`` to see how many different paths we are able to take.
fr: Maintenant que l'on a effectué une execution, on peux essayer d'explorer le programme en symbolisant ``argv`` pour voir quels sont les chemins qui ont pu être empruntés.

source: We now have completed a very simple exploration, where we covered two distincts paths.
fr: Deux chemins ont été explorés pendant l'exécution.

source: All inputs, crashes and various metadata are stored in a workspace. Unless explicitely specified the workspace is created in */tmp/triton_workspace/[timestamp]*. If a workspace directory is given via the ``Config`` this one is loaded *(which enables restarting an interrupted run)*.
fr: Toutes les entrées, crashs et certaines métadonnées sont stockées dans l'espace de travail. À moins d'être explicitement mentionnés le dossier est crée dans le dossier */tmp/triton_workspace/[timestamp]*.Si un dossier de workspace est donné via la configuration, celui-ci est chargé *(ce qui permet de redémarrer une exploration interrompue)*.

source: The whole corpus and crashes generated shall now be available in this directory.
fr: Le corpus et les crash générés doivent être disponibles dans ce dossier.
