Repository: nbruns1/tritondse
Catalog: doc/locale/*/LC_MESSAGES/practicals/toy_example.po
Languages: fr

source: Toy Example
fr: Exemple jouet

source: These toy examples will present you various use-cases containing a bug to trigger. The goal is to trigger them using the tritondse exploration.
fr: Ces exemples montrent des cas d'usages contenant un crash à trouver.Le but est de les activer en utilisant l'exploration et les callbacks nécessaires.

source: 1. Non standard input
fr: 1. Entrée non-standard

source: By default tritondse is able to inject input either on stdin either on argv. The goal here is to trigger the bug by injection the symbolisation at an arbitrary location.
fr: Par défaut TritonDSE est capable d'injecter l'entrée soit sur stdin soit sur argv. Le but ici est d'activer le bug en injectant l'entrée symbolique à une adresse arbitraire.

source: 2. Symbolic read
fr: 2. Lecture symbolique

source: By default the exploration just negate branches, but does not try to perform state coverage on pointer values *(as it raises a lot of test-cases potentially not interesting)*. The goal here is to perform manual state coverage on pointer values.
fr: Par défaut l'exploration se contente de nier les branchements conditionnels, mais rien n'est fait pour effectuer de la couverture sur les valeurs de pointeurs *(car cela lève de très nombreux cas de tests poentiellement inintéressants)*. Le but ici est d'effectuer une couverture d'état sur les valeurs de pointeurs.

source: 3. Symbolic read & write
fr: 3. Lecture / écriture symbolique

source: Same principle here, except that triggering the bug require resolving some kind of a pointer aliasing issue.
fr: Le principe est le même sauf que activer le bug nécessite de résoudre le problème d'aliasing de pointeur.

source: 4. String length
fr: 4. Longueur d'une chaîne

source: Symbolic execution hardly infers 'meta-properties' of data. For string its length is a meta-property that the symbolic executor does not know how to mutate. It can be an issue when performing coverage.
fr: L'exécution symbolique infère difficillement les méta-propriétés des données comme la longueur d'une chaine. L'exécuteur n'a aucune manière de muter cette longueur et cela peut être problématique pour effectuer de la couverture.

source: 5. Off-by-One example
fr: 5. Exemple de Off-by-One

source: Write a simple intrinsic function to obtain the stack buffer size during exploration, and write a simple sanitizer for `strncpy` that checks that no buffer overflow is taking place.
fr: Il faut ici écrire une fonctin simple pour obtenir la taille du tampon sur la pile durant l'exploration et écrire le sanitiseur sur `strncpy` qui permet de vérifier que le débordement à lieu.
